In [1]:
import pandas as pd
import numpy as np

s = pd.Series([1,2,4,123])
s

0      1
1      2
2      4
3    123
dtype: int64

In [2]:
datalist = np.array([2,12,223,3])
print('len= '+str(len(datalist)))
s = pd.Series(datalist)
s
print('s[2]='+str(s[2]))
print(s[1])

len= 4
s[2]=223
12

In [3]:
p = pd.Series(datalist,index = [100,101,102,105])
p

100      2
101     12
102    223
105      3
dtype: int32

In [4]:
data2 = 5
da2 = pd.Series(data2, index = [1, 3, 4])
da2

1    5
3    5
4    5
dtype: int64

In [5]:
data1 = {'a':2,'b':44,'c':2,'3':88}
dal = pd.Series(data1, index = ['a','3','d','c'])
print(dal['3'])
print(dal[:4])
dal

88.0
a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

a     2.0
3    88.0
d     NaN
c     2.0
dtype: float64

## DataFrame

In [6]:
f1 = pd.DataFrame()
print(f1)
f1

Empty DataFrame
Columns: []
Index: []

Empty DataFrame
Columns: []
Index: []

In [7]:
list1 = [1,23,33,4,3]
f2 = pd.DataFrame(list1)
f2

    0
0   1
1  23
2  33
3   4
4   3

In [8]:
print(f2)

    0
0   1
1  23
2  33
3   4
4   3

In [9]:
list3 = [["liu",2],['sun',8],['bule','jun']]
f3 = pd.DataFrame(list3)
f3

      0    1
0   liu    2
1   sun    8
2  bule  jun

## 字典

In [10]:
list4 = [{'liu':'kk','jun':'as'},{'liu':'bb','jun':'ss','hell':'kk9'}]
list4

[{'liu': 'kk', 'jun': 'as'}, {'liu': 'bb', 'jun': 'ss', 'hell': 'kk9'}]

In [11]:
f5 = pd.DataFrame(list4)
f5

  hell jun liu
0  NaN  as  kk
1  kk9  ss  bb

In [12]:
f6 = pd.DataFrame(list4,index = ['fies','sec'])
f6['jun']

fies    as
sec     ss
Name: jun, dtype: object

In [13]:
f7 = pd.DataFrame(list4, index = ['no1','no2'], columns = ['liu', 'jun'])
f7

    liu jun
no1  kk  as
no2  bb  ss

# 字典的系列可以传递以形成一个DataFrame。 所得到的索引是通过的所有系列索引的并集。

In [14]:
list18 = {'one':pd.Series([1,3,2,],index=['ll','kk','jj']), 'two':pd.Series([33,23,22],index=['ll','kk','bb'])}
f8 = pd.DataFrame(list18)
f8

    one   two
bb  NaN  22.0
jj  2.0   NaN
kk  3.0  23.0
ll  1.0  33.0

# 列选择

In [15]:
f8['one']

bb    NaN
jj    2.0
kk    3.0
ll    1.0
Name: one, dtype: float64

In [16]:
f8['one'].tolist()

[nan, 2.0, 3.0, 1.0]

## 列添加

In [17]:
f8['three'] = pd.Series(['99','990','88'],index = ['ll','kk','bb'])
f8

    one   two three
bb  NaN  22.0    88
jj  2.0   NaN   NaN
kk  3.0  23.0   990
ll  1.0  33.0    99

# 列删除

In [18]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
unsorted_df

       col2      col1
1  1.230285  0.814065
4  0.070263 -0.273584
6  1.433437 -0.061886
2 -1.506602  1.672587
3  1.188428 -0.180059
5 -0.549431 -1.210738
9  0.143469 -0.305965
8  1.506628 -0.587492
0 -1.214781  0.441305
7  0.175841 -1.194387

In [19]:
sort_df = unsorted_df.sort_index()
sort_df

       col2      col1
0 -1.214781  0.441305
1  1.230285  0.814065
2 -1.506602  1.672587
3  1.188428 -0.180059
4  0.070263 -0.273584
5 -0.549431 -1.210738
6  1.433437 -0.061886
7  0.175841 -1.194387
8  1.506628 -0.587492
9  0.143469 -0.305965

In [20]:
sort_udf = unsorted_df.sort_index (ascending = False)
sort_udf

       col2      col1
9  0.143469 -0.305965
8  1.506628 -0.587492
7  0.175841 -1.194387
6  1.433437 -0.061886
5 -0.549431 -1.210738
4  0.070263 -0.273584
3  1.188428 -0.180059
2 -1.506602  1.672587
1  1.230285  0.814065
0 -1.214781  0.441305

In [21]:
kk = unsorted_df.sort_index(axis = 1)
kk

       col1      col2
1  0.814065  1.230285
4 -0.273584  0.070263
6 -0.061886  1.433437
2  1.672587 -1.506602
3 -0.180059  1.188428
5 -1.210738 -0.549431
9 -0.305965  0.143469
8 -0.587492  1.506628
0  0.441305 -1.214781
7 -1.194387  0.175841

In [22]:
kk1 = kk.sort_values(by = 'col1')
kk1

       col1      col2
5 -1.210738 -0.549431
7 -1.194387  0.175841
8 -0.587492  1.506628
9 -0.305965  0.143469
4 -0.273584  0.070263
3 -0.180059  1.188428
6 -0.061886  1.433437
0  0.441305 -1.214781
1  0.814065  1.230285
2  1.672587 -1.506602

In [23]:
kk2 = kk.sort_values(by = ['col1','col2'])
kk2

       col1      col2
5 -1.210738 -0.549431
7 -1.194387  0.175841
8 -0.587492  1.506628
9 -0.305965  0.143469
4 -0.273584  0.070263
3 -0.180059  1.188428
6 -0.061886  1.433437
0  0.441305 -1.214781
1  0.814065  1.230285
2  1.672587 -1.506602

In [24]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],          
        'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
kk3 = pd.DataFrame(ipl_data)
kk3

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [25]:
kk3.groupby('Team')

In [26]:
kk4 =kk3.groupby('Team').groups
kk4

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [27]:
kk5 = kk3.groupby(['Team','Year']).groups
kk5

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

# format

In [28]:
print('{},{}'.format('liu','jun'))

liu,jun

In [29]:
print('{0}{1}'.format('liu','jun'))

liujun

In [30]:
print('{1},{0},{1}'.format('liu','jun'))

jun,liu,jun

In [31]:
print('{name},{age}'.format(name='liu',age=18))

liu,18

In [32]:
list1=['ni','hao','21']
ss = 'wold ssi {}'.format(list1)
ss

"wold ssi ['ni', 'hao', '21']"

In [33]:
b_dict={"name":'liu', "sex":'nan'}
kk = 'wold shift {name},sex is {sex}'.format(**b_dict)
kk

'wold shift liu,sex is nan'

In [34]:
listkk= ['12',"nin",'hao']
s1 = ','.join(listkk)
s1

'12,nin,hao'

In [35]:
s2 = ','.join("'"+x+"'" for x in listkk)
s2

"'12','nin','hao'"

In [36]:
from numpy import nan as NaN
df1=pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [37]:
df1.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  2.0
2  0.0  0.0  0.0
3  8.0  8.0  0.0

In [38]:
import numpy as np
df=pd.DataFrame(np.arange(16).reshape((4,4)),index=list(range(4)),columns=['a','b','c','d'])

In [39]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
df.loc[1:3,['b','c']]

    b   c
1   5   6
2   9  10
3  13  14

In [41]:
df['b']

0     1
1     5
2     9
3    13
Name: b, dtype: int32

In [42]:
df[0:2]

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [43]:
df.loc[df.loc[:,'a']>1]

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [44]:
df.d

0     3
1     7
2    11
3    15
Name: d, dtype: int32

In [45]:
size_list = ['a','b','c','d']

for i in size_list:
    print(df.loc[df[i],i])

0     0.0
4     NaN
8     NaN
12    NaN
Name: a, dtype: float64
1     5.0
5     NaN
9     NaN
13    NaN
Name: b, dtype: float64
2     10.0
6      NaN
10     NaN
14     NaN
Name: c, dtype: float64
3     15.0
7      NaN
11     NaN
15     NaN
Name: d, dtype: float64

C:\Users\liuju\AppData\Local\Continuum\anaconda3\envs\python3.6\lib\site-packages\pandas\core\indexing.py:1017: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

In [46]:
for i in size_list:
    df.loc[df[i]<3,i] =0
    df.loc[df[i]>5,i] =1
df

   a  b  c  d
0  0  0  0  3
1  4  5  1  1
2  1  1  1  1
3  1  1  1  1

In [47]:
fs11 = pd.DataFrame([[21, 1.0,3.0,1],
                   [31, 4.0,5.0,2],
                   [21, 4.0,5.0,-3],
                   [5, 0.0,6.0,4]],

columns = list('ABCD'))
fs11

    A    B    C  D
0  21  1.0  3.0  1
1  31  4.0  5.0  2
2  21  4.0  5.0 -3
3   5  0.0  6.0  4

In [48]:
fs11.cumsum(axis=1)

      A     B     C     D
0  21.0  22.0  25.0  26.0
1  31.0  35.0  40.0  42.0
2  21.0  25.0  30.0  27.0
3   5.0   5.0  11.0  15.0

In [49]:
fs11['max'] = fs11['A']+fs11['B']
fs11

    A    B    C  D   max
0  21  1.0  3.0  1  22.0
1  31  4.0  5.0  2  35.0
2  21  4.0  5.0 -3  25.0
3   5  0.0  6.0  4   5.0

In [50]:

fs11['sum'] = fs11['D'].cumsum()
fs11

    A    B    C  D   max  sum
0  21  1.0  3.0  1  22.0    1
1  31  4.0  5.0  2  35.0    3
2  21  4.0  5.0 -3  25.0    0
3   5  0.0  6.0  4   5.0    4

In [51]:
import numpy as np

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','z'], columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
a -0.031900  0.947402 -1.059601 -1.170946
b -0.543276  0.150260  0.250040  1.033077
c -0.585490 -0.321457  1.938550  0.851967
d  1.106650 -1.358477  0.211033 -0.031918
e  2.138671 -1.869403 -0.443715 -1.300326
f  1.208801  0.769684 -0.206972  0.918966
g -0.004161  1.102321 -0.035162  0.309766
z -1.245051 -1.013032  1.770170 -0.037108

In [52]:
df['A']

a   -0.031900
b   -0.543276
c   -0.585490
d    1.106650
e    2.138671
f    1.208801
g   -0.004161
z   -1.245051
Name: A, dtype: float64

In [53]:
df.loc[:,['A','D']]

          A         D
a -0.031900 -1.170946
b -0.543276  1.033077
c -0.585490  0.851967
d  1.106650 -0.031918
e  2.138671 -1.300326
f  1.208801  0.918966
g -0.004161  0.309766
z -1.245051 -0.037108

In [54]:
df.loc[df['D']<0, 'D'] = 0
df

          A         B         C         D
a -0.031900  0.947402 -1.059601  0.000000
b -0.543276  0.150260  0.250040  1.033077
c -0.585490 -0.321457  1.938550  0.851967
d  1.106650 -1.358477  0.211033  0.000000
e  2.138671 -1.869403 -0.443715  0.000000
f  1.208801  0.769684 -0.206972  0.918966
g -0.004161  1.102321 -0.035162  0.309766
z -1.245051 -1.013032  1.770170  0.000000

In [55]:
df.loc[['a','e'],['A','D']]

          A    D
a -0.031900  0.0
e  2.138671  0.0

In [56]:
df.loc['a':'e',['A','D']]

          A         D
a -0.031900  0.000000
b -0.543276  1.033077
c -0.585490  0.851967
d  1.106650  0.000000
e  2.138671  0.000000

In [57]:
df.loc['a':'e']

          A         B         C         D
a -0.031900  0.947402 -1.059601  0.000000
b -0.543276  0.150260  0.250040  1.033077
c -0.585490 -0.321457  1.938550  0.851967
d  1.106650 -1.358477  0.211033  0.000000
e  2.138671 -1.869403 -0.443715  0.000000

# loc 两个是参数，前面一个是判断条件，缺失的时候，考虑那个是默认的. 第一个参数是行或者判断条件，第一个参数是列，缺失的情况下 默认是所有

In [58]:
df.loc['a']

A   -0.031900
B    0.947402
C   -1.059601
D    0.000000
Name: a, dtype: float64

In [59]:
df.loc[:,'A']

a   -0.031900
b   -0.543276
c   -0.585490
d    1.106650
e    2.138671
f    1.208801
g   -0.004161
z   -1.245051
Name: A, dtype: float64

# 第一个参数是条件：列A 所有大于0的数，第二个参数是对应的列

In [60]:
df.loc[df['A']>0,'A']=0

In [61]:
df

          A         B         C         D
a -0.031900  0.947402 -1.059601  0.000000
b -0.543276  0.150260  0.250040  1.033077
c -0.585490 -0.321457  1.938550  0.851967
d  0.000000 -1.358477  0.211033  0.000000
e  0.000000 -1.869403 -0.443715  0.000000
f  0.000000  0.769684 -0.206972  0.918966
g -0.004161  1.102321 -0.035162  0.309766
z -1.245051 -1.013032  1.770170  0.000000

In [62]:
df['sumCD'] = df['C']+df['D']
df

          A         B         C         D     sumCD
a -0.031900  0.947402 -1.059601  0.000000 -1.059601
b -0.543276  0.150260  0.250040  1.033077  1.283117
c -0.585490 -0.321457  1.938550  0.851967  2.790517
d  0.000000 -1.358477  0.211033  0.000000  0.211033
e  0.000000 -1.869403 -0.443715  0.000000 -0.443715
f  0.000000  0.769684 -0.206972  0.918966  0.711994
g -0.004161  1.102321 -0.035162  0.309766  0.274604
z -1.245051 -1.013032  1.770170  0.000000  1.770170

In [63]:
df['test'] = df['A'].sum()
df

          A         B         C         D     sumCD      test
a -0.031900  0.947402 -1.059601  0.000000 -1.059601 -2.409878
b -0.543276  0.150260  0.250040  1.033077  1.283117 -2.409878
c -0.585490 -0.321457  1.938550  0.851967  2.790517 -2.409878
d  0.000000 -1.358477  0.211033  0.000000  0.211033 -2.409878
e  0.000000 -1.869403 -0.443715  0.000000 -0.443715 -2.409878
f  0.000000  0.769684 -0.206972  0.918966  0.711994 -2.409878
g -0.004161  1.102321 -0.035162  0.309766  0.274604 -2.409878
z -1.245051 -1.013032  1.770170  0.000000  1.770170 -2.409878

In [64]:
sale_data = {'prod_id': ['1101', '1101', '1107', '1107', '11071',
         '1102', '11022', '2200', '3300', '999', '44', '66'],
         'size_id': [12, 12, 233, 233, 21,888 ,888,144,277 , 477,177,2888],
         'Year': [2014-1,2015-3,2014-3,2015-9,2014-1,2015,2016,2017,2016,2014,2015,2017],          
        'qty':[8,79,863,73,1,0,756,0,64,7,8,6]}
sale_data = pd.DataFrame(sale_data)

In [65]:
sale_data

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
4    11071       21  2013    1
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [66]:
sale_data.set_index(['prod_id','size_id'],inplace = True)

In [67]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [68]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [69]:
sale_data_1 = sale_data['qty'].sum(level = ['prod_id','size_id']).reset_index().rename(columns = {'qty':'sumaa'})
sale_data_1

lll = sale_data_1.set_index(['prod_id','size_id']).reset_index(['prod_id','size_id'])

In [70]:
sale_data_1

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [71]:
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [72]:
lll.reset_index()
lll

  prod_id  size_id  sumaa
0    1101       12     87
1    1107      233    936
2   11071       21      1
3    1102      888      0
4   11022      888    756
5    2200      144      0
6    3300      277     64
7     999      477      7
8      44      177      8
9      66     2888      6

In [73]:
sale_data['Year']

prod_id  size_id
1101     12         2013
         12         2012
1107     233        2011
         233        2006
11071    21         2013
1102     888        2015
11022    888        2016
2200     144        2017
3300     277        2016
999      477        2014
44       177        2015
66       2888       2017
Name: Year, dtype: int64

In [74]:
type(sale_data['Year'])

pandas.core.series.Series

In [75]:
pd.to_datetime(sale_data['Year'])

prod_id  size_id
1101     12        1970-01-01 00:00:00.000002013
         12        1970-01-01 00:00:00.000002012
1107     233       1970-01-01 00:00:00.000002011
         233       1970-01-01 00:00:00.000002006
11071    21        1970-01-01 00:00:00.000002013
1102     888       1970-01-01 00:00:00.000002015
11022    888       1970-01-01 00:00:00.000002016
2200     144       1970-01-01 00:00:00.000002017
3300     277       1970-01-01 00:00:00.000002016
999      477       1970-01-01 00:00:00.000002014
44       177       1970-01-01 00:00:00.000002015
66       2888      1970-01-01 00:00:00.000002017
Name: Year, dtype: datetime64[ns]

In [76]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [77]:
salemax = sale_data.groupby(['prod_id','size_id'])
salemax['qty'].max().reset_index().rename(columns={'qty':'max'})

  prod_id  size_id  max
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [78]:
col_group = ['prod_id','size_id']
salemax = sale_data.groupby(col_group)['qty'].max().reset_index()

In [79]:
salemax

  prod_id  size_id  qty
0    1101       12   79
1    1102      888    0
2   11022      888  756
3    1107      233  863
4   11071       21    1
5    2200      144    0
6    3300      277   64
7      44      177    8
8      66     2888    6
9     999      477    7

In [80]:
salemax.set_index(['prod_id','size_id'],inplace= True)
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [81]:
salemax.loc[salemax['qty']>0].index

MultiIndex(levels=[['1101', '1102', '11022', '1107', '11071', '2200', '3300', '44', '66', '999'], [12, 21, 144, 177, 233, 277, 477, 888, 2888]],
           codes=[[0, 2, 3, 4, 6, 7, 8, 9], [0, 7, 4, 1, 5, 3, 8, 6]],
           names=['prod_id', 'size_id'])

In [82]:
salemax

                 qty
prod_id size_id
1101    12        79
1102    888        0
11022   888      756
1107    233      863
11071   21         1
2200    144        0
3300    277       64
44      177        8
66      2888       6
999     477        7

In [83]:
qq = salemax.reset_index().groupby(['prod_id','size_id']).count()
qq.columns = ['count']
qq

                 count
prod_id size_id
1101    12           1
1102    888          1
11022   888          1
1107    233          1
11071   21           1
2200    144          1
3300    277          1
44      177          1
66      2888         1
999     477          1

# sort_index()

In [84]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),columns=['c','a','b'],index=['D','B','C','A'])

In [85]:
frame

   c   a   b
D  0   1   2
B  3   4   5
C  6   7   8
A  9  10  11

In [86]:
frame.sort_index(inplace =True)

In [87]:
frame

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [88]:
frame_copy = frame.copy()

In [89]:
frame_copy

   c   a   b
A  9  10  11
B  3   4   5
C  6   7   8
D  0   1   2

In [90]:
frame_copy['col'] = 1
frame_copy.set_index('col', inplace= True)
frame_copy

     c   a   b
col
1    9  10  11
1    3   4   5
1    6   7   8
1    0   1   2

# append

In [91]:
df1 = pd.DataFrame([[1, 2,7,7], [3, 4,8,8]], columns=list('ABCD'))
df1['is'] = 0
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2['is'] =1

In [92]:
df1

   A  B  C  D  is
0  1  2  7  7   0
1  3  4  8  8   0

In [93]:
df2

   A  B  is
0  5  6   1
1  7  8   1

In [94]:
org = df1.append(df2, sort = False)

org

In [95]:
org['col'] =1

In [96]:
org

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  NaN   1    1
1  7  8  NaN  NaN   1    1

In [97]:
org.fillna({'D':0})

   A  B    C    D  is  col
0  1  2  7.0  7.0   0    1
1  3  4  8.0  8.0   0    1
0  5  6  NaN  0.0   1    1
1  7  8  NaN  0.0   1    1

In [98]:
week_no = pd.DataFrame(list(range(-4,0)),columns = ['week_no'])
week_no

   week_no
0       -4
1       -3
2       -2
3       -1

In [99]:
week_no['col_on'] = 1

In [100]:
week_no

   week_no  col_on
0       -4       1
1       -3       1
2       -2       1
3       -1       1

In [101]:
week_no.set_index('col_on',inplace =True)

In [102]:
week_no

        week_no
col_on
1            -4
1            -3
1            -2
1            -1

In [103]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [104]:
qs = sale_data.reset_index().groupby(['prod_id','size_id']).count()

In [105]:
qs

                 Year  qty
prod_id size_id
1101    12          2    2
1102    888         1    1
11022   888         1    1
1107    233         2    2
11071   21          1    1
2200    144         1    1
3300    277         1    1
44      177         1    1
66      2888        1    1
999     477         1    1

# drop

In [106]:
sale_data.drop(['Year'],axis=1)

                 qty
prod_id size_id
1101    12         8
        12        79
1107    233      863
        233       73
11071   21         1
1102    888        0
11022   888      756
2200    144        0
3300    277       64
999     477        7
44      177        8
66      2888       6

In [107]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [108]:
sale_data.reset_index().drop([4])

   prod_id  size_id  Year  qty
0     1101       12  2013    8
1     1101       12  2012   79
2     1107      233  2011  863
3     1107      233  2006   73
5     1102      888  2015    0
6    11022      888  2016  756
7     2200      144  2017    0
8     3300      277  2016   64
9      999      477  2014    7
10      44      177  2015    8
11      66     2888  2017    6

In [109]:
sale_data

                 Year  qty
prod_id size_id
1101    12       2013    8
        12       2012   79
1107    233      2011  863
        233      2006   73
11071   21       2013    1
1102    888      2015    0
11022   888      2016  756
2200    144      2017    0
3300    277      2016   64
999     477      2014    7
44      177      2015    8
66      2888     2017    6

In [110]:
sale_copy = sale_data

# 删除列 drop

In [111]:
sale_data.drop(columns = ['qty'],axis = 1,inplace =True)

In [112]:
sale_data

                 Year
prod_id size_id
1101    12       2013
        12       2012
1107    233      2011
        233      2006
11071   21       2013
1102    888      2015
11022   888      2016
2200    144      2017
3300    277      2016
999     477      2014
44      177      2015
66      2888     2017


# rename_axis

In [113]:
sale_data.rename_axis(['A','b'])

            Year
A     b
1101  12    2013
      12    2012
1107  233   2011
      233   2006
11071 21    2013
1102  888   2015
11022 888   2016
2200  144   2017
3300  277   2016
999   477   2014
44    177   2015
66    2888  2017

In [114]:
sale_data.reset_index(inplace = True)

# sum(axis=1)

In [115]:
sale_data['sum'] = sale_data[['size_id','Year']].sum(axis=1)
sale_data

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

# datetime

In [116]:
import datetime as dt

In [117]:
date_dec = dt.datetime.now().date()

In [118]:
date_dec

datetime.date(2019, 4, 18)

In [119]:
date_cut = pd.to_datetime(date_dec - dt.timedelta(days= 7))

In [120]:
date_cut

Timestamp('2019-04-11 00:00:00')

In [121]:
sale_data

   prod_id  size_id  Year   sum
0     1101       12  2013  2025
1     1101       12  2012  2024
2     1107      233  2011  2244
3     1107      233  2006  2239
4    11071       21  2013  2034
5     1102      888  2015  2903
6    11022      888  2016  2904
7     2200      144  2017  2161
8     3300      277  2016  2293
9      999      477  2014  2491
10      44      177  2015  2192
11      66     2888  2017  4905

In [122]:
sale_data['date_sell'] = '2019-04-01'

In [123]:
sale_data

   prod_id  size_id  Year   sum   date_sell
0     1101       12  2013  2025  2019-04-01
1     1101       12  2012  2024  2019-04-01
2     1107      233  2011  2244  2019-04-01
3     1107      233  2006  2239  2019-04-01
4    11071       21  2013  2034  2019-04-01
5     1102      888  2015  2903  2019-04-01
6    11022      888  2016  2904  2019-04-01
7     2200      144  2017  2161  2019-04-01
8     3300      277  2016  2293  2019-04-01
9      999      477  2014  2491  2019-04-01
10      44      177  2015  2192  2019-04-01
11      66     2888  2017  4905  2019-04-01

In [124]:
sale_data['date_sell']= pd.to_datetime(sale_data['date_sell'])

In [125]:
sale_data['week_no'] = (sale_data['date_sell'] -
                         pd.to_datetime(date_dec)).dt.days//7

In [126]:
sale_data

   prod_id  size_id  Year   sum  date_sell  week_no
0     1101       12  2013  2025 2019-04-01       -3
1     1101       12  2012  2024 2019-04-01       -3
2     1107      233  2011  2244 2019-04-01       -3
3     1107      233  2006  2239 2019-04-01       -3
4    11071       21  2013  2034 2019-04-01       -3
5     1102      888  2015  2903 2019-04-01       -3
6    11022      888  2016  2904 2019-04-01       -3
7     2200      144  2017  2161 2019-04-01       -3
8     3300      277  2016  2293 2019-04-01       -3
9      999      477  2014  2491 2019-04-01       -3
10      44      177  2015  2192 2019-04-01       -3
11      66     2888  2017  4905 2019-04-01       -3

In [127]:
# sale_data.loc[sale_data['we']>2000,['prod_id','sieze_id']].index

In [128]:
sale_data.index

RangeIndex(start=0, stop=12, step=1)

In [129]:
jaj = sale_data.reset_index(['prod_id','size_id']).groupby(['prod_id', 'size_id']).max()

KeyError: 'Level prod_id must be same as name (None)'

In [ ]:
sale_data[sale_data['we']> 2200].index()

# dateutil.relativedelta import relativedalta

In [ ]:
from dateutil.relativedelta import relativedelta

In [ ]:
lastday = (date_dec - relativedelta(days= 1)).strftime('%Y-%m-%d')

In [ ]:
lastday

In [ ]:
lastmonth = (date_dec - relativedelta (months = 1)).strftime('%Y-%m-%d')

In [ ]:
lastmonth


# 时间间隔对象

In [ ]:
testtime = dt.timedelta(days = 7)

In [ ]:
testtime

In [ ]:
kk3 = pd.to_datetime('2030-5-10')
kk3

In [ ]:
kk3 > date_cut

In [ ]:
df

In [ ]:
sale_copy

In [ ]:
sale_copy.set_index(['prod_id','size_id']).groupby(['prod_id','size_id']).sum()

In [ ]:
sale_copy

In [ ]:
sale_copy.index.drop_duplicates()

In [ ]:
# sale_copy['size_id'].max(level = [])

In [ ]:
sale_copy

In [ ]:
sale_copy['col']=1

In [ ]:
sale_copy_1 = sale_copy

In [ ]:
# p1 = sale_copy_1.reset_index('col', inplace = True)
# p1

In [ ]:
# p = sale_copy.reset_index('col', inplace = True)
# p

In [ ]:
p1.join(p)

In [ ]:
sale_copy

In [ ]:
import numpy as np
sale_copy['we'] = sale_copy['sum'].map(lambda x: 1/(  1 + np.exp(-10 * (x+1))))

In [ ]:
sale_copy

In [ ]:
x =lambda x: 1/(1 + np.exp(-10 * (x+1)))

In [ ]:
x

In [ ]:
sale_data

# prod 返回请求轴的乘积

In [ ]:
sale_data[['sum','we']].prod(axis=1)

In [ ]:
#copy

In [ ]:
sale_data

In [ ]:
sale_pp = sale_data.loc[sale_data['Year'] == 2013, ['prod_id','size_id']].copy()

In [ ]:
sale_pp

In [ ]:
cols_grp2 = ['prod_id', 'color_id', 'mng_reg_id', 'size']

In [ ]:
cols_grp2[2]

In [ ]:
sale_data

In [ ]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [ ]:
sale_data

In [ ]:
sale_data['sum'].max(level = ['prod_id','size_id'])

In [ ]:
sale_data['sum'].max()

In [ ]:
sale_data

In [ ]:
sale_data['sum'].mean(level = ['prod_id','size_id'])

In [ ]:
sale_data[['col','sum']].prod(axis =1)

In [ ]:
sale_data

In [ ]:
sale_data['col'].reset_index(['prod_id','size_id'])

In [ ]:
sale_data

In [ ]:
sale_data['yes'] = sale_data[['col','we']].sum(axis=1)

In [ ]:
sale_data

In [ ]:
sale_data.loc[sale_data['sum']>sale_data['col'], 'we'] =  sale_data.loc[sale_data['sum']>sale_data['col'],'sum']

In [ ]:
sale_data

# multiprocessing

In [ ]:
import multiprocessing
from multiprocessing import Pool, cpu_count

In [ ]:
cpu_count()

# map(func, iterable[, chunksize=None])
# Pool类中的map方法，与内置的map函数用法行为基本一致，它会使进程阻塞直到返回结果。 
# 注意，虽然第二个参数是一个迭代器，但在实际使用中，必须在整个队列都就绪后，程序才会运行子进程。

In [ ]:
sale_data

In [ ]:
sale_data.index.get_level_values(level = 'size_id')

# get_level_values uique()

In [ ]:
sale_data.index.get_level_values(level = 'size_id').unique()

In [ ]:
gg = sale_data.index.get_level_values(level = 'size_id').unique()

In [ ]:
gg

In [ ]:
gg.shape[0]

In [ ]:
import math
skc_num_sum = 30
skc_num_grp = 30
range(math.ceil(skc_num_sum / skc_num_grp))

# at

In [ ]:
sale_data.reset_index().at[0,'we']

In [ ]:
sale_data.reset_index(inplace = True)

In [ ]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [ ]:
sale_data

In [ ]:
# sale_data.at[('2200','144'), 'we']

In [ ]:
cols_mov = ['prod_id', 'color_id', 'size', 'org_send_id', 'org_rec_id']

    # Moving records
q = pd.DataFrame(columns=cols_mov + ['quant_mov']).set_index(cols_mov)

In [ ]:
q

In [ ]:
cols_stc = ['prod_id', 'color_id', 'size', 'org_id']

In [ ]:
cols_stc[-2]

In [ ]:
sale_data.reset_index()

In [ ]:
test0 = sale_data.index.get_level_values('size_id').unique()

In [ ]:
mub=test0.shape[0]

In [ ]:
mub

In [ ]:
grap = 3

# 分组 math.ceil

In [ ]:
for i in range (math.ceil(mub/grap)):
    print(i)

In [ ]:
sale_data

# dict sum( .values())

In [ ]:
dict1 = {'a': 10, 'b': 2, 'c': 3}

In [ ]:
dict1

In [ ]:
sum(dict1.values())

In [ ]:
pp = pd.DataFrame(dict1, index = ['haha'])

In [ ]:
pp

In [ ]:
pp.T.rename_axis('qt')

In [ ]:
dict2 = {('pro','size'):'10',('pro1','size1'):90}

In [ ]:
dict2

# dict key 有多个值

In [ ]:
dict2[('pro','size')]

In [ ]:
dict2[('pro1','size1')]

In [ ]:
sale_data

In [ ]:
sale_copy = sale_data.copy().rename(columns={'col':'he'})

In [ ]:
sale_copy

In [ ]:
sale_copy.join(sale_data, how = 'outer',rsuffix = '_add')

In [ ]:
sale_data

In [ ]:
# sale_data.set_index(['prod_id','size_id'])
sale_data.reset_index(inplace = True)

In [ ]:
sale_data

In [ ]:
ca = (sale_data['size_id'] ==144) & (sale_data['sum'] ==2161)

In [ ]:
ca

In [ ]:
sale_data.loc[ca,['col','sum']]

In [ ]:
sale_data['yes'] = 10

In [ ]:
sale_data

In [ ]:
sale_data[(sale_data['we']==4905)]

In [ ]:
sale_data[(sale_data['we']==4905)].index.unique()

# 创建多层列索引 pd.MultiIndex.from_product

In [ ]:
coll = pd.MultiIndex.from_product([['期中','期末'],names = ['语文','数学']])

In [ ]:
coll

In [ ]:
df = pd.DataFrame(data = np.random.randint(2,8, size = (2,4)),
          index = ['yom','kou'],
          columns = coll)

In [ ]:
df

In [ ]:
df['期中']

In [ ]:
df['期末']

In [ ]:
data= [1,2,3]

In [ ]:
a= pd.DataFrame(data)

In [ ]:
a

In [ ]:
max (11, 0)

In [ ]:
max(-1, 0)

# sign

In [ ]:
datalist = [-1, 10, 90, -88, 92, 3, 0, 19, 0]

In [ ]:
np.sign(datalist)

In [ ]:
from dateutil.relativedelta import relativedelta
date + =relativedelta(months=1)

In [ ]:
sale_data

In [ ]:
sale_data.drop_duplicates(['prod_id','size_id'])

# DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)
    subset : column label or sequence of labels, optional 
        用来指定特定的列，默认所有列
    keep : {‘first’, ‘last’, False}, default ‘first’ 
        删除重复项并保留第一次出现的项
    inplace : boolean, default False 
        是直接在原来数据上修改还是保留一个副本

In [ ]:
list1 = [0.1, 21, 232.890]

In [ ]:
list1

In [ ]:
type(list1)

In [ ]:
list2 = np.array(list1)

In [ ]:
list2

In [ ]:
type(list2)

In [ ]:
list3 = list2.astype('int')

In [ ]:
list3

# astype

In [ ]:
list4 = list2.astype('float')

In [ ]:
list4

In [ ]:
# list5 = list1.astype('int')

In [ ]:
sale_data

In [ ]:
sale_copy

In [ ]:
sale_copy.drop([66])

In [ ]:
sale_data.index()

In [ ]:
haha  = sale_copy[sale_copy['we']==4905]

In [ ]:
haha

In [ ]:
haha.reset_index(inplace =  True)

In [ ]:
haha

In [ ]:
haha.drop([0])

In [ ]:
sale_data

In [ ]:
sale_data.set_index(['prod_id','size_id'], inplace = True)

In [ ]:
sale_data

In [ ]:
mm = sale_data.loc[sale_data['we']>2400].index

In [ ]:
mm

In [ ]:
sale_data.reset_index(inplace = True)

In [ ]:
sale_copy.reset_index(inplace = True)

In [ ]:
org = sale_data.append(sale_copy,sort = False)

In [ ]:
org

In [ ]:
org['col_on'] =1

In [ ]:
org

In [ ]:
org.set_index('col_on',inplace = True)

In [ ]:
org

In [ ]:
org['sum'].values[1]

# set() 函数创建一个无序不重复元素集，可进行关系测试，删除重复数据，还可以计算交集、差集、并集等   | :并集  &：交集  - ：差集

In [ ]:
a = [1,23,1,2,23]

In [ ]:
a

In [ ]:
b = set(a)

In [ ]:
b

In [ ]:
a1 =[1,3,4,1]

In [ ]:
b1 = set(a1)

In [ ]:
b1

In [ ]:
d = set(a) | set(a1)

In [ ]:
d

In [ ]:
jiaoji = d & set(a1)

In [ ]:
jiaoji

In [ ]:
listk  = [12,3,32,31,32,2]

In [ ]:
list1 = pd.DataFrame(listk, columns=['id1'])

In [ ]:
list1

In [ ]:
a = 6

In [ ]:
b =1

In [ ]:
a

In [ ]:
c = a | b

In [ ]:
c

In [ ]:
d = 100

In [ ]:
mm = d | a

In [ ]:
mm

In [ ]:
d

In [ ]:
aa=99

In [ ]:
hh = aa | mm

In [ ]:
hh

In [ ]:
hh = mm | aa

In [ ]:
hh

In [ ]:
sale_data

In [ ]:
sale_data.loc [sale_data['Year']>2015]

In [ ]:
sale_data.loc[(sale_data['Year']>2015) | (sale_data['sum']> 2400)]

In [ ]:
sale_data[sale_data['we']>0].set_index('prod_id').index.unique()

In [ ]:
mms = pd.DataFrame()

In [ ]:
if not mms.empty:
    print ('不为空')

In [ ]:
sale_data

In [ ]:
sale_data.groupby(['prod_id']).max()

In [ ]:
list1 = pd.DataFrame(list1)

In [ ]:
list1

In [ ]:
list2 = list1.copy().rename(columns = {'id1':'id2'})

In [ ]:
list2 = pd.DataFrame(list2)

In [ ]:
list2

In [ ]:
d3 = set(list1)

In [ ]:
d3

In [ ]:
d4 = set(list2)

In [ ]:
d4

In [ ]:
d5 = set(list1) | set(list2)

In [ ]:
d5

In [ ]:
d6 = set(list1)

In [ ]:
d6

In [ ]:
d7 = list1 & list2

In [ ]:
d7

# df.update(other, join='left', overwrite=True, filter_func=None, raise_conflict=False)
 
用途：
    # 用另一个DataFrame中的非NA值进行就地修改
 
参数：
    # other：DataFrame，至少有一个匹配的索引/列标签;Series必设name属性
    # join：{'left'}仅实现左连接，保留原始对象的索引和列
    # overwrite =True：处理重叠键(行索引)非NA值：
    #     * True：覆盖原始df值
    #     * False：仅更新原始df中na的值
 
    # filter_func：callable（1d-array） - > boolean 1d-array
    #     可替换NA以外值。返回True表示值应该更新。函数参数作用于df
    # raise_conflict=False：为True，则会在df和other同一位置都是非na值时引发ValueError

In [ ]:
d7

In [ ]:
nw = pd.DataFrame({'id2': [21, 22,23],'C': [24, 25, 26]})

In [ ]:
nw

In [ ]:
d7.update(nw)

In [ ]:
d7

In [ ]:
print('jaj')

In [ ]:
sale_data

In [ ]:
sale_data[:2]

In [ ]:
cols_grp = ['prod_id', 'color_id', 'size']

In [ ]:
cols_grp[:2]

# unique()    value_count()

In [ ]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c','c'])

In [ ]:
obj

In [ ]:
obj.unique()

In [ ]:
obj.value_counts()

# isin

In [ ]:
obj.isin(['a','b'])

In [ ]:
sale_data

In [ ]:
saleset = sale_data.set_index(['prod_id','size_id'])

In [ ]:
saleset

In [ ]:
skc =sale_data.set_index(['prod_id','size_id'])

In [ ]:
skc

In [ ]:
sale_copy.set_index(['prod_id'],inplace = True)

In [ ]:
sale_copy.index.unique()

In [ ]:
index1 = sale_copy.index.unique()

In [ ]:
sale_fuzhi = sale_copy[:6]

In [ ]:
sale_fuzhi

In [ ]:
index2 = sale_fuzhi.index.unique()

In [ ]:
index1

In [ ]:
index2

In [ ]:
locindex = index1.isin(index2)

In [ ]:
locindex

# loc[a.index isin b.index]

In [ ]:
sale_data.loc[locindex]

In [134]:
sale_copy.set_index('prod_id',inplace= True)

In [135]:
sale_copy

         size_id  Year   sum  date_sell  week_no
prod_id
1101          12  2013  2025 2019-04-01       -3
1101          12  2012  2024 2019-04-01       -3
1107         233  2011  2244 2019-04-01       -3
1107         233  2006  2239 2019-04-01       -3
11071         21  2013  2034 2019-04-01       -3
1102         888  2015  2903 2019-04-01       -3
11022        888  2016  2904 2019-04-01       -3
2200         144  2017  2161 2019-04-01       -3
3300         277  2016  2293 2019-04-01       -3
999          477  2014  2491 2019-04-01       -3
44           177  2015  2192 2019-04-01       -3
66          2888  2017  4905 2019-04-01       -3

In [136]:
sale_copy.reset_index()

   prod_id  size_id  Year   sum  date_sell  week_no
0     1101       12  2013  2025 2019-04-01       -3
1     1101       12  2012  2024 2019-04-01       -3
2     1107      233  2011  2244 2019-04-01       -3
3     1107      233  2006  2239 2019-04-01       -3
4    11071       21  2013  2034 2019-04-01       -3
5     1102      888  2015  2903 2019-04-01       -3
6    11022      888  2016  2904 2019-04-01       -3
7     2200      144  2017  2161 2019-04-01       -3
8     3300      277  2016  2293 2019-04-01       -3
9      999      477  2014  2491 2019-04-01       -3
10      44      177  2015  2192 2019-04-01       -3
11      66     2888  2017  4905 2019-04-01       -3

In [137]:
sale_copy

         size_id  Year   sum  date_sell  week_no
prod_id
1101          12  2013  2025 2019-04-01       -3
1101          12  2012  2024 2019-04-01       -3
1107         233  2011  2244 2019-04-01       -3
1107         233  2006  2239 2019-04-01       -3
11071         21  2013  2034 2019-04-01       -3
1102         888  2015  2903 2019-04-01       -3
11022        888  2016  2904 2019-04-01       -3
2200         144  2017  2161 2019-04-01       -3
3300         277  2016  2293 2019-04-01       -3
999          477  2014  2491 2019-04-01       -3
44           177  2015  2192 2019-04-01       -3
66          2888  2017  4905 2019-04-01       -3

In [145]:
import time

In [146]:
shijian = time.time()

In [147]:
pd.to_datetime(shijian)

Timestamp('1970-01-01 00:00:01.555595672')

In [148]:
type(shijian)

float

In [149]:
strkk = "1553817600"

In [150]:
timeArray = time.localtime(strkk)

TypeError: an integer is required (got type str)

In [151]:
dt.datetime.now()

datetime.datetime(2019, 4, 18, 22, 2, 53, 81364)

In [153]:
 dt.datetime.utcfromtimestamp(strkk)

TypeError: an integer is required (got type str)

In [154]:
astype(strkk)

NameError: name 'astype' is not defined

In [155]:
sale_data

         size_id  Year   sum  date_sell  week_no
prod_id
1101          12  2013  2025 2019-04-01       -3
1101          12  2012  2024 2019-04-01       -3
1107         233  2011  2244 2019-04-01       -3
1107         233  2006  2239 2019-04-01       -3
11071         21  2013  2034 2019-04-01       -3
1102         888  2015  2903 2019-04-01       -3
11022        888  2016  2904 2019-04-01       -3
2200         144  2017  2161 2019-04-01       -3
3300         277  2016  2293 2019-04-01       -3
999          477  2014  2491 2019-04-01       -3
44           177  2015  2192 2019-04-01       -3
66          2888  2017  4905 2019-04-01       -3

In [159]:
sale_data.drop(['week_no'],axis=1,inplace=True)

In [160]:
sale_data

         size_id  Year   sum  date_sell
prod_id
1101          12  2013  2025 2019-04-01
1101          12  2012  2024 2019-04-01
1107         233  2011  2244 2019-04-01
1107         233  2006  2239 2019-04-01
11071         21  2013  2034 2019-04-01
1102         888  2015  2903 2019-04-01
11022        888  2016  2904 2019-04-01
2200         144  2017  2161 2019-04-01
3300         277  2016  2293 2019-04-01
999          477  2014  2491 2019-04-01
44           177  2015  2192 2019-04-01
66          2888  2017  4905 2019-04-01

In [161]:
sale_data['sum'] = sale_data['date_sell']

In [162]:
sale_data

         size_id  Year        sum  date_sell
prod_id
1101          12  2013 2019-04-01 2019-04-01
1101          12  2012 2019-04-01 2019-04-01
1107         233  2011 2019-04-01 2019-04-01
1107         233  2006 2019-04-01 2019-04-01
11071         21  2013 2019-04-01 2019-04-01
1102         888  2015 2019-04-01 2019-04-01
11022        888  2016 2019-04-01 2019-04-01
2200         144  2017 2019-04-01 2019-04-01
3300         277  2016 2019-04-01 2019-04-01
999          477  2014 2019-04-01 2019-04-01
44           177  2015 2019-04-01 2019-04-01
66          2888  2017 2019-04-01 2019-04-01

In [171]:
dt.datetime.strptime('2019-02-10', "%Y-%m-%d")

datetime.datetime(2019, 2, 10, 0, 0)

In [173]:
dt.datetime.strptime('2019-02-10', "%Y-%m-%d").date()-dt.timedelta(days=3)

datetime.date(2019, 2, 7)

In [4]:
import datetime as dt

In [5]:
DECISION_DATE=dt.date.today()

In [7]:
DECISION_DATE

datetime.date(2019, 4, 19)

In [9]:
(DECISION_DATE+ dt.timedelta(days=1)).strftime("%Y-%m-%d")

'2019-04-20'